Revit 2025 API
LightShapeStyle Enumeration
 Tags for specific light shape styles
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LightShapeStyle
Public Enumeration LightShapeStyle
public enum class LightShapeStyle
type LightShapeStyle
Members
Member name | Value | Description
Point | 0 |  Point light shape.
Line | 1 |  Line light shape.
Rectangle | 2 |  Rectangular light shape.
Circle | 3 |  Circular light shape.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace